RANS_Simulations/_template/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Wing + wheel half-car mesh.
//
// All lengths are in METRES. Allmesh scales the generator STLs from mm to m
// and writes them to constant/triSurface/{wing,wheel}.stl.
//
// Reference: base cell 0.01875 m, so refinement level n gives
//   L4 1.172 mm   L5 0.586 mm   L6 0.293 mm   L7 0.146 mm
//
// The per-region levels below are a direct translation of the refinement
// table from the previous HELYX setup. See docs/07_case_reference.md for the
// full setting-by-setting mapping, including the two places where
// snappyHexMesh cannot express what HELYX did.

castellatedMesh true;
snap            true;
addLayers       true;


// ---------------------------------------------------------------------------
// Geometry
// ---------------------------------------------------------------------------
geometry
{
    wing.stl
    {
        type        triSurfaceMesh;
        name        wing;

        regions
        {
            wing-suction         { name wing-suction;         }
            wing-pressure        { name wing-pressure;        }
            wing-TE              { name wing-TE;              }
            wing-endplate_inner  { name wing-endplate_inner;  }
            wing-endplate_outer  { name wing-endplate_outer;  }
            wing-endplate_top    { name wing-endplate_top;    }
            wing-endplate_bottom { name wing-endplate_bottom; }
            wing-endplate_LE     { name wing-endplate_LE;     }
            wing-endplate_TE     { name wing-endplate_TE;     }
        }
    }

    wheel.stl
    {
        type        triSurfaceMesh;
        name        wheel;

        regions
        {
            wheel-tread     { name wheel-tread;     }
            wheel-shoulders { name wheel-shoulders; }
            wheel-sidewall  { name wheel-sidewall;  }
            wheel-plinth    { name wheel-plinth;    }
        }
    }

    // Volume refinement boxes, carried over 1:1 from the HELYX volRef list
    // (which was given in mm; divided by 1000 here).
    L2-farfield
    {
        type    searchableBox;
        min     (-0.300  0.000  0.000);
        max     ( 0.600  0.300  0.250);
    }

    L3-body
    {
        type    searchableBox;
        min     (-0.200  0.000  0.000);
        max     ( 0.350  0.200  0.150);
    }

    L4-neargeom
    {
        type    searchableBox;
        min     (-0.160  0.000  0.000);
        max     ( 0.200  0.150  0.120);
    }

    L4-wake
    {
        type    searchableBox;
        min     ( 0.040  0.000  0.000);
        max     ( 0.300  0.170  0.130);
    }

    L5-gap-underwing
    {
        type    searchableBox;
        min     (-0.150  0.060  0.000);
        max     ( 0.060  0.130  0.060);
    }

    L5-vortex-inboard
    {
        type    searchableBox;
        min     (-0.100  0.020  0.000);
        max     ( 0.200  0.110  0.050);
    }

    L5-vortex-outboard
    {
        type    searchableBox;
        min     (-0.100  0.100  0.000);
        max     ( 0.200  0.145  0.050);
    }

    // Local zones that replace per-region distance refinement, which
    // snappyHexMesh does not support (HELYX did this on the wing-ep-bottom
    // and wheel-plinth surfaces individually).
    //
    // Endplate bottom edge: HELYX refined to L6 within 3 mm of that surface.
    L6-endplate-bottom-edge
    {
        type    searchableBox;
        min     (-0.145  0.095  0.004);
        max     (-0.048  0.112  0.016);
    }

    // Wheel contact patch: HELYX refined to L7 within 5 mm of the plinth.
    L7-contact-patch
    {
        type    searchableBox;
        min     (-0.050  0.070  0.000);
        max     ( 0.050  0.122  0.008);
    }
}


// ---------------------------------------------------------------------------
// Castellated mesh
// ---------------------------------------------------------------------------
castellatedMeshControls
{
    maxLocalCells       4000000;

    // The HELYX mesh for the baseline case finished at 18.7 M cells. This cap
    // is deliberately well above that: snappyHexMesh counts cells *before*
    // removing the part outside the fluid, so the cap must leave headroom or
    // refinement is cut off mid-level.
    maxGlobalCells      40000000;

    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 3;

    // Feature edges extracted by surfaceFeatureExtract. These are what keep
    // the blunt trailing edge and the endplate edges sharp.
    features
    (
        { file "wing.eMesh";  level 6; }
        { file "wheel.eMesh"; level 6; }
    );

    // Surface-based refinement: (min max) level per STL region.
    refinementSurfaces
    {
        wing
        {
            level       (5 6);
            patchInfo   { type wall; inGroups (wingGroup); }

            regions
            {
                wing-suction         { level (5 6); patchInfo { type wall; inGroups (wingGroup); } }
                wing-pressure        { level (5 6); patchInfo { type wall; inGroups (wingGroup); } }

                // Blunt TE, 0.5 mm thick: needs L7 to carry more than one cell
                wing-TE              { level (6 7); patchInfo { type wall; inGroups (wingGroup); } }

                // Endplate main faces are flat, so they stay coarser
                wing-endplate_inner  { level (4 5); patchInfo { type wall; inGroups (wingGroup); } }
                wing-endplate_outer  { level (4 5); patchInfo { type wall; inGroups (wingGroup); } }
                wing-endplate_top    { level (4 5); patchInfo { type wall; inGroups (wingGroup); } }

                // Bottom edge sheds the main endplate vortex
                wing-endplate_bottom { level (5 6); patchInfo { type wall; inGroups (wingGroup); } }

                wing-endplate_LE     { level (5 5); patchInfo { type wall; inGroups (wingGroup); } }
                wing-endplate_TE     { level (5 5); patchInfo { type wall; inGroups (wingGroup); } }
            }
        }

        wheel
        {
            level       (5 6);
            patchInfo   { type wall; inGroups (wheelGroup wheelRotating); }

            regions
            {
                // Every wheel region is in wheelGroup (used for force
                // integration) plus a motion group that decides its velocity
                // boundary condition.
                wheel-tread     { level (5 6); patchInfo { type wall; inGroups (wheelGroup wheelRotating); } }
                wheel-shoulders { level (5 6); patchInfo { type wall; inGroups (wheelGroup wheelRotating); } }
                wheel-sidewall  { level (5 6); patchInfo { type wall; inGroups (wheelGroup wheelRotating); } }

                // Plinth is the contact-patch collar; it moves with the ground,
                // not with the rotating wheel, hence the other motion group.
                wheel-plinth    { level (6 7); patchInfo { type wall; inGroups (wheelGroup wheelGround); } }
            }
        }
    }

    resolveFeatureAngle 30;

    // ---------------------------------------------------------------------
    // Region-wise refinement
    // ---------------------------------------------------------------------
    refinementRegions
    {
        // Distance refinement around the bodies: the HELYX 'default' entry
        // asked for L5 within 15 mm and L4 within 30 mm.
        wing
        {
            mode    distance;
            levels  ((0.015 5) (0.030 4));
        }

        wheel
        {
            mode    distance;
            levels  ((0.015 5) (0.030 4));
        }

        L2-farfield             { mode inside; levels ((1E15 2)); }
        L3-body                 { mode inside; levels ((1E15 3)); }
        L4-neargeom             { mode inside; levels ((1E15 4)); }
        L4-wake                 { mode inside; levels ((1E15 4)); }
        L5-gap-underwing        { mode inside; levels ((1E15 5)); }
        L5-vortex-inboard       { mode inside; levels ((1E15 5)); }
        L5-vortex-outboard      { mode inside; levels ((1E15 5)); }
        L6-endplate-bottom-edge { mode inside; levels ((1E15 6)); }
        L7-contact-patch        { mode inside; levels ((1E15 7)); }
    }

    // A point in the fluid, well clear of any geometry or cell face. The
    // offsets keep it off the base-mesh face planes.
    locationInMesh (0.5001 0.3001 0.3001);

    allowFreeStandingZoneFaces true;
}


// ---------------------------------------------------------------------------
// Snapping
// ---------------------------------------------------------------------------
snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              50;
    nRelaxIter              5;

    // Feature snapping. The endplate edges and the blunt TE only stay sharp
    // with explicit feature snapping against the extracted eMesh files.
    nFeatureSnapIter        15;
    implicitFeatureSnap     false;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
}


// ---------------------------------------------------------------------------
// Layers
// ---------------------------------------------------------------------------
addLayersControls
{
    // Absolute thicknesses, in metres. HELYX used an absolute first layer of
    // 0.14 mm with expansion 1.3 over 4 layers, which is what is reproduced
    // here: 0.140, 0.182, 0.237, 0.308 mm -> 0.866 mm total.
    //
    // At U = 10 m/s and c = 75 mm the first cell centre sits at y+ ~ 2.5,
    // i.e. in the buffer layer. That is why the wall functions in 0.orig are
    // the continuous all-y+ variants rather than the pure log-law ones.
    relativeSizes       false;

    expansionRatio      1.3;
    firstLayerThickness 0.00014;
    minThickness        0.00004;

    layers
    {
        "wing-.*"
        {
            nSurfaceLayers 4;
        }

        "wheel-.*"
        {
            nSurfaceLayers 4;
        }

        // Ground plane: coarser first layer, fewer layers. Carried over from
        // the HELYX CustomHHMDict override for the minZ patch.
        ground
        {
            nSurfaceLayers      3;
            firstLayerThickness 0.00025;
        }
    }

    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              5;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
    nRelaxedIter            20;
}


// ---------------------------------------------------------------------------
// Mesh quality
// ---------------------------------------------------------------------------
meshQualityControls
{
    #include "meshQualityDict"

    nSmoothScale    4;
    errorReduction  0.75;
}


writeFlags
(
    scalarLevels
    layerSets
    layerFields     // volScalarField of layer coverage, for checking
);

mergeTolerance 1e-6;


// ************************************************************************* //
