RANS_Simulations/_template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "<case>/include/caseParameters"

// simpleFoam is incompressible: p is kinematic pressure, p/rho, in m^2/s^2.
// Multiply by rhoInf to get Pa.
dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pRef;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform $pRef;
    }

    symmetry
    {
        type            symmetry;
    }

    "(side|sky)"
    {
        type            slip;
    }

    "(ground|wingGroup|wheelRotating|wheelGround)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
