RANS_Simulations/_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;

    // Cell-limited gradients keep the solution monotone across the strong
    // pressure gradients under the wing and around the contact patch.
    grad(U)         cellLimited Gauss linear 1;
    grad(k)         cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    // Second-order upwind-biased convection for momentum. The V variant uses
    // a single limiter for the whole vector, which is better behaved in
    // vortex cores than limiting each component separately.
    div(phi,U)      bounded Gauss linearUpwindV grad(U);

    // Turbulence transport: first-order upwind. Deliberate. k and omega
    // transport with a second-order scheme is what usually stalls the
    // residuals on this kind of mesh, and the effect on the forces is small.
    turbulence      bounded Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// Wall distance is needed by the kOmegaSST blending functions. meshWave is
// the accurate option; it is recomputed only once for a steady mesh.
wallDist
{
    method          meshWave;
}


// ************************************************************************* //
