RANS_Simulations/_template/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;

        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels     1;
    }

    // Potential-flow initialisation (potentialFoam) solves for Phi
    Phi
    {
        $p;
        relTol          0.0;
    }

    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
        nSweeps         1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    // SIMPLEC. Converges in noticeably fewer iterations than plain SIMPLE and
    // tolerates the relaxation factors below.
    consistent          yes;

    // Stop early once everything is below these initial residuals. This is
    // what keeps a 420-case campaign affordable: most cases converge well
    // before the endTime in system/controlDict.
    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|omega)"     1e-4;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        U               0.9;
        "(k|omega)"     0.7;
    }
}

// Caching grad(U) saves recomputing it for the convection limiter and the
// turbulence production term in every outer iteration.
cache
{
    grad(U);
}


// ************************************************************************* //
