RANS_Simulations/_template/Allrun
#!/usr/bin/env bash
# ===========================================================================
# Allrun - mesh, solve and summarise this case in one go
#
#   ./Allrun            full run (skips meshing if a mesh is already there)
#   ./Allrun --force    remesh from scratch, then solve
#
# This is just the three stages in order. Run them separately when you want
# to inspect the mesh before committing compute to the solve:
#   ./Allmesh  ->  ./Allsolve  ->  ./Allpost
# ===========================================================================
set -euo pipefail
cd "${0%/*}" || exit 1

MESH_ARGS=()
for arg in "$@"; do
    case "$arg" in
        --force|-f) MESH_ARGS+=(--force) ;;
        -h|--help)  sed -n '2,12p' "$0"; exit 0 ;;
        *)          echo "unknown argument: $arg" >&2; exit 1 ;;
    esac
done

./Allmesh "${MESH_ARGS[@]+"${MESH_ARGS[@]}"}"
./Allsolve
./Allpost --summary
